 
pole=[["*","*","*","*","*","*","*","*","*","*"],
    ["*","*","*","*","*","*","*","*","*","*"],
    ["*","*","*","*","*","*","*","*","*","*"],
    ["*","*","*","*","*","*","*","*","*","*"],
    ["*","*","*","*","*","*","*","*","*","*"],
    ["*","*","*","*","*","*","*","*","*","*"],
    ["*","*","*","*","*","*","*","*","*","*"],
    ["*","*","*","*","*","*","*","*","*","*"],
    ["*","*","*","*","*","*","*","*","*","*"],
    ["*","*","*","*","*","*","*","*","*","*"]]
x=0
y=0
ox=0
oy=0
pole[x][y]="0"

# for line in pole:
#     for ch in line:
#         print(ch + " ", end = "")
#     print()
    
for string in pole:
    print(string)
 

    
answer=""
while answer !="exit":
    answer=input("введи направление")
    if answer== "left":
        y=y-1
    if answer=="right":
        y=y+1
    if answer=="up":
        x=x-1
    if answer=="down":
        x=x+1
        
    pole[ox][oy]="*"
    ox = x
    oy = y
    pole[x][y]="0"
    for string in pole:
        print(string)

    
    
    
    
    

