print("Вы заперты в замке. В нём обитает огромный дракон. Выберитесь как можно скорее , вечно вы прятатся не сможете... ")
a = input().lower() #lower все буквы в строчные превращает
# а теперь, если игрок ввёл что-то другое,
# колесо сансары в лице цикла while не отпустит его, пока
# он не введёт что-то из этих трёх вариантов
while a != "направо" and a != "налево" and a != "вперёд" and "стоять на месте" and "идти назад" and "gamer3335521" :
    a = input("выберите: направо, налево, вперёд, стоять на месте, идти назад, gamer3335521: ").lower()
# ну теперь точно выбрал что надо
if a == "направо":
   print("Вы видите развилку. Один путь ведёт в неизвестность, в конце второго виден свет, а в конце третьего тупик")
while a != "Пойти по первому пути" and "пойти по второму пути" and "пойти по третьему пути" and "стоять на месте" and "вернуться назад"
    a=input("Выберите ,что делать. Пойти по первому пути, пойти по второму пути, пойти по третьему пути , стоять на месте, вернуться назад")
if a=="Пойти по первому пути" :
# поборов свой страх вы отправлетесь в неизведанное...
       print("Вы нашли пустой коридор и пошли до конца. В конце вы нашли записку с надписью 'ключ от ворот в падвале или на чердаке, поищи там'")
    a = input("выберите: вернуться, остаться: ").lower()
    while a != "вернуться" and a != "спуститься":
        a = input("выберите: вернуться, спуститься: ").lower()
     if a == "вернуться":
        print("Вы вернулись назад и услышали странный звук рядом с вами")
        print("Вы без раздумий убежали. Вы вернулись туда откуда и начали...")
        a=input("выберите: направо, налево, вперёд, стоять на месте, идти назад, gamer3335521:")
if a== "направо" :
   print("Вы видите развилку. Один путь ведёт в неизвестность, в конце второго виден свет, а в конце третьего тупик")
 while a != "Пойти по первому пути" and "пойти по второму пути" and "пойти по третьему пути" and "стоять на месте" and "вернуться назад"
    a=input("Выберите ,что делать. Пойти по первому пути, пойти по второму пути, пойти по третьему пути , стоять на месте, вернуться назад")
    if a== "пойти по первому пути" :
       print("Вы нашли пустой коридор и пошли до конца. В конце вы нашли записку с надписью 'ключ от ворот в падвале или на чердаке, поищи там'")
  a = input("выберите: вернуться, остаться: ").lower()
    while a != "вернуться" and a != "остаться":
        a = input("выберите: вернуться, остаться: ").lower()
     if a == "остаться":
         print("вы услышали громкий рыг оттуда откуда пришли, рыг всё сближался с вами. Вы патылись бежать, но не успели..."
         print("Game Over")
while a != "направо" and a != "налево" and a != "вперёд" and "стоять на месте" and "идти назад" and "gamer3335521" :
    a = input("выберите: направо, налево, вперёд, стоять на месте, идти назад, gamer3335521: ").lower()
# ну теперь точно выбрал что надо
if a== "направо" :
   print("Вы видите развилку. Один путь ведёт в неизвестность, в конце второго виден свет, а в конце третьего тупик")
 while a != "Пойти по первому пути" and "пойти по второму пути" and "пойти по третьему пути" and "стоять на месте" and "вернуться назад"
    a=input("Выберите ,что делать. Пойти по первому пути, пойти по второму пути, пойти по третьему пути , стоять на месте, вернуться назад")
if a == "пойти по третьему пути" :
   print("вы просто зашли в тупик")
 a = input("выберите: вернуться, остаться: ").lower()
    while a != "вернуться" and a != "остаться":
        a = input("выберите: вернуться, остаться: ").lower()
     if a == "остаться":
        print("нечего не произошло")
a = input("выберите: вернуться, остаться: ").lower()
    while a != "вернуться" and a != "остаться":
        a = input("выберите: вернуться, остаться: ").lower()
if a =="вернуться" :
   print("вы вернулись на то же место")
   print("Вы видите развилку. Один путь ведёт в неизвестность, в конце второго виден свет, а в конце третьего тупик")
 while a != "Пойти по первому пути" and "пойти по второму пути" and "пойти по третьему пути" and "стоять на месте" and "вернуться назад"
    a=input("Выберите ,что делать. Пойти по первому пути, пойти по второму пути, пойти по третьему пути , стоять на месте, вернуться назад")
if a=="стоять на месте" :
   print("вы взбесили создателя игры своим бездействием. Вы убиты.")
   print("Game Over")
   print("Вы видите развилку. Один путь ведёт в неизвестность, в конце второго виден свет, а в конце третьего тупик")
 while a != "Пойти по первому пути" and "пойти по второму пути" and "пойти по третьему пути" and "стоять на месте" and "вернуться назад"
    a=input("Выберите ,что делать. Пойти по первому пути, пойти по второму пути, пойти по третьему пути , стоять на месте, вернуться назад")
if a=("вернуться назад") :
# вы вернулись туда где всё и начиналось.
while a != "направо" and a != "налево" and a != "вперёд" and "стоять на месте" and "идти назад" and "gamer3335521" :
    a = input("выберите: направо, налево, вперёд, стоять на месте, идти назад, gamer3335521: ").lower()
# ну теперь точно выбрал что надо
if a == "gamer3335521" :
   print("создатель игры поленился и подарил вам победу за одно слово.")
   print("Поздравляю, было так сложно, но ты справился")
while a != "направо" and a != "налево" and a != "вперёд" and "стоять на месте" and "идти назад" and "gamer3335521" :
    a = input("выберите: направо, налево, вперёд, стоять на месте, идти назад, gamer3335521: ").lower()
# ну теперь точно выбрал что надо
if a == "стоять на месте"
   print("вы просто потратили время")
while a != "направо" and a != "налево" and a != "вперёд" and "стоять на месте" and "идти назад" and "gamer3335521" :
    a = input("выберите: направо, налево, вперёд, стоять на месте, идти назад, gamer3335521: ").lower()
# ну теперь точно выбрал что надо
if a =="идти назад"
   print("идя назад, вы устали , но продолжили идти.")
   print("вы нашли подвал.")
while a != "взять" and a !="идти дальше"
    if a == "взять"
     print("вы ашли ключик")
    else:
        print("Вы видите корону")
        a = input("Выберите: надеть или не надевать: ").lower()
        while a != "надеть" and a != "не надевать":
           a = input("Выберите: надеть/не надевать": ).lower()
        if a == "надеть":
            print("В подвал врывается дракон, но вы уже в короне и его правитель")
            print("Вам с драконом предстоит много замечательных приключений")
            print("С победой!")
        else:
            print("В подвал врывается дракон и съедает вас")
            print("Game over")
elif a == "налево":
    print("Вас встретил дракон и съел")
    print("Game over")
# ну, значит, вперёд
else:
    print("Вы вышли из замка и услышали сзади грозный рык")
    print("Вы пытались убежать от дракона, но он быстрее и сильнее")
    print("Game over")